'use strict'; 
// task1. Створіть програму, яка обчислює факторіал натурального числа n, яке користувач введе з клавіатури.
// n! = n * (n - 1) * (n - 2) * ...* 1.
// 1! = 1
// 2! = 2 * 1 = 2
// 3! = 3 * 2 * 1 = 6
// 4! = 4 * 3 * 2 * 1 = 24
// 5! = 5 * 4 * 3 * 2 * 1 = 120

// let n = +prompt('write count loop');
// let result = 1;
// for (let i = 1; i <= n; i++){
//   result*=i;
//   console.log(result);
// }



// task2.
// Створіть програму, що виводить на екран всі чотиризначні числа послідовності 1000 1003 1006 1009 1012 1015 … 9999

// for (let i = 1000; i <= 9999; i += 3){
//   document.write(`<h2>Loop ${i}</h2>`);
// }



// task3.
// Створіть програму, що виводить на екран перші 55 елементів послідовності 1 3 5 7 9 11 13 15 17…

// for (let i = 1, n = 1; i <= 55; n+= 2, ++i){
//     console.log(n);
// }

// let n = 1;
// for (let i = 1; i <= 55; ++i){
//   console.log(n);
//   n += 2;
// }



// task4. Створіть програму, що виводить на екран всі невід'ємні елементи послідовності 90 85 80 75 70 65 60…

// for (let i = 90; i >= 0; i -= 5){
//   console.log(i);
// }



// task5.Створіть програму, що виводить на екран перші 20 елементів послідовності 2 4 8 16 32 64 128…

// let n = 2;
// for (let i = 1; i <= 20; i++) {
//   console.log(n);
//   n *= 2;
// }

// for (let i = 1, n = 2; i <= 20; n *= 2, ++i) {
//   console.log(n);
// }



// task6.Виведіть на екран всі числа в послідовності 2a-1(крок зміни лічильника),
// де початкове значення a = 2 та які менше 10000.

// for (let a = 2; a < 10000; a = a * 2 - 1){
//   console.log(a);
// }



// task7.Виведіть на екран всі двозначні члени послідовності 2a + 200
//   (крок зміни лічильника),
//   де початкове значення змінної a = -166.

// for (let a = -166; a < 100; a = a * 2 + 200){
//  if (a>-100 && (a<-9||a>9)) {
//    console.log(a);
//   }
// }



// task8. Написати програму що обчислює піднесення до степеня.
//   В 1й промпт вводиться число, а в 2й промпт степінь.
//   Умови: Степінь може бути додатня, від'ємна або 0.
//     Обрахувати всі можливі варіанти циклом for.
//     Задачу бажано виконати використовуючи 1 цикл!
// a^b = a*a b раз; 
// a^-b= 1/a^b;  
// a^0 = 1; 


// let a = +prompt('Введіть число'); 
// let b = +prompt('Введіть степінь'); 
// let result = 1;
// if (b > 0) {
//   for (let i = 1; i <= b; i++) {
//     result *= a;
//   }
// }
// else if (b < 0) {
//   for (let i = b; i < 0; i++) {
//     result /= a;
//   }
// }
// console.log(result);
   

   

let a = +prompt('Введіть число');
let b = +prompt('Введіть степінь');
let result = 1;
let check = false;
if (b < 0) {
    check = true;
    b = -b;
}
for (let i = 1; i <= b; i++) {
    result *= a;
}
if (check) {
  result = 1 / result;
}
console.log(result);