// task 1

// let count = 0;
// console.log('count =', count);

// let ask = prompt('1. Якого року проголошено Акт Незалежності України?');
// if (ask === '1991') {
//   alert('Вірно');
//   count++;
// } else {
//   alert('Не вірно');
// }
// console.log('count =', count);

// let ask1 = prompt('2. Дата, коли депутати проголосували за Акт проголошення Незалежності?');
// if (ask1.toLowerCase() === '24 серпня 1991 року' || ask1 === '24.08.1991 р.' || ask1 === '24.08.91') {
//   alert('Вірно');
//   count++;
// } else {
//   alert('Не вірно. Депутати Верховної Ради УРСР проголосували за Акт проголошення Незалежності України на екстреній сесії 24 серпня 1991 року. Тоді проголосували «за» незалежність 392 із 450 депутатів.');
// }
// console.log('count =', count);

// let ask2 = prompt('3. Хто був першим президентом незалежної України?');
// if (ask2.toLowerCase() === 'леонід кравчук' || ask2.toLowerCase() ==='кравчук') {
//   alert('Вірно. Кравчук переміг уже в першому турі, отримавши понад 60 % голосів.');
//   count++;
// } else {
//   alert('Не вірно');
// }
// console.log('count =', count);

// let ask3 = prompt('4. Яке місце посідає українська мова за своєю красою серед інших мов світу?');
// if (ask3.toLowerCase() === 'Третє' || ask3 ==='3') {
//   alert('Вірно');
//   count++;
// } else {
//   alert('Не вірно. На конкурсі краси мов, у Парижі в 1934 році, українська мова зайняла третє місце після французької та перської. А за мелодійністю друге місце, після італійської.');
// }
// console.log('count =', count);

// let ask4 = prompt('5. Найбільш вживаною літерою в українському алфавіті є…');
// if (ask4.toLowerCase() === 'п') {
//   alert('Вірно.Також на цю літеру починається найбільша кількість слів.');
//   count++;
// } else {
//   alert('Не вірно. На літеру "П" починається найбільша кількість слів.');
// }
// console.log('count =', count);

// let ask5 = prompt('6. Яке українське містечко вважається географічним центром Європи?');
// if (ask5.toLowerCase() === 'рахів') {
//   alert('Вірно');
//   count++;
// } else {
//   alert('Не вірно.Українське містечко Рахів, розташове серед Карпат, офіційно вважається географічним центром Європи.');
// }
// console.log('count =', count);

// let ask6 = prompt('7.Коли запровадили національну валюту гривню?');
// if (ask6 === '1996') {
//   alert('Вірно');
//   count++;
// } else {
//   alert('Не вірно. В 1996 р. в обіг введено національну валюту України гривню та її соту частку копійку.');
// }
// console.log('count =', count);

// let ask7 = prompt('8. У якому році вперше на Євробаченні виступив представник України?');
// if (ask7 === '2003') {
//   alert('Вірно');
//   count++;
// } else {
//   alert('Не вірно. У 2003 р. Олександр Пономарьов із піснею «Hasta la Vista»');
// }
// console.log('count =', count);

// let ask8 = prompt('9. Одна з найвідоміших у світі різдвяних пісень — це …');
// if (ask8 === 'Щедрик' || ask8 ==='«Щедрик»'|| ask8.toLowerCase() === 'щедрик') {
//   alert('Вірно. У світі відома як Carol of the Bells або Ring Christmas Bells.');
//   count++;
// } else {
//   alert('Не вірно.Це «Щедрик».У світі відома як Carol of the Bells або Ring Christmas Bells.');
// }
// console.log('count =', count);

// let ask9 = prompt('10. Діяч культури, який має найбільшу кількість пам’ятників у світі');
// if (ask9 === 'Тарас Шевченко' || ask9 ==='Т.Шевченко'|| ask9.toLowerCase() ==='шевченко') {
//   alert('Вірно.Українському Кобзареві встановлено 1384 пам’ятники по всіх куточках світу.');
//   count++;
// } else {
//   alert('Не вірно. Тарасу Шевченку,українському Кобзареві, встановлено 1384 пам’ятники по всіх куточках світу.');
// }
// console.log('count =', count);

// if (count >= 0 && count <= 2) {
//   alert('Погано, коли не знаєш історії рідної країни');
// }
// else if (count >= 3 && count <= 4) {
//   alert('Кожен Українець повинен знати свою історію!');
// }
// else if (count >= 5 && count<8) {
//   alert('Слабенько. Вчи історію!');
// }
// else if (count >=8 && count <= 9) {
//   alert('Не погано, але треба ще підучити');
// }
// else if (count === 10) {
//   alert('Молодець! Ти багато знаєш про Україну!');
// }

// task2

// let yourName = prompt(`Ваше ім'я`, '');
// if (yourName == "ім'я") {
//   let pass = prompt('Ваш пароль');
//   if (pass.toLowerCase() == 'логос') {
//     alert('Ласкаво просимо!');
//   }
//     else if (pass == '' || pass == null) {
//     alert( 'Скасовано' );
//   } else {
//     alert( 'Невірний пароль' );
//   }
  
// } else if (yourName == '' || yourName == null) {
//   alert( 'Скасовано' );
// } else {
//   alert( "Я вас не знаю" );
// }


// task3

let number = +prompt('Введіть число до 20');
if (number >= 1 && number <= 12) {
  let numSeason = +prompt('Введіть номер вашого улюбленого місяця');
    if (numSeason ===1 || numSeason === 2 || numSeason === 12) {
    alert('ЗИМА');
  }
    else if (numSeason === 3 || numSeason === 4 || numSeason === 5) {
    alert('ВЕСНА.');
  }
    else if (numSeason === 6 || numSeason === 7 || numSeason === 8) {
    alert('ЛІТО.');
  }
    else if (numSeason === 9 || numSeason === 10 || numSeason === 11) {
    alert('ОСІНЬ.');
  }

} else {
  alert('На жаль, визначити улюблену пору року неможливо');
}

// my task

// let number = prompt('Скільки місяців у році?');
// if (number === '12') {
//   let numSeason = +prompt('Введіть номер вашого улюбленого місяця');
//     if (numSeason == '1' || numSeason == '2' || numSeason == '12') {
//     alert('"Падав сніг,падав сніг–для усіх, усіх, усіх,І дорослих і малих,І веселих і сумних.Що прийшла?" ЗИМА');
//   }
//     else if (numSeason == '3' || numSeason == '4' || numSeason == '5') {
//     alert('"Де учора сніг білів,там струмочок задзвенів.На галявинці у лісі білі проліски звелися.Пташки весело співають,і дерева розквітають.Прокидаючись від сну,зустрічає світ.." ВЕСНУ.');
//   }
//     else if (numSeason == '6' || numSeason == '7' || numSeason == '8') {
//     alert('"В небі ластівка летить,з вітром листя шелестить,воду п’є лелека.Сонце палить.Спека.Дозріває жито.Яка пора?" ЛІТО.');
//   }
//     else if (numSeason == '9' || numSeason == '10' || numSeason == '11') {
//     alert('"Листя стало золотим.На полях туман, як дим.Сірий дощик накрапає,сумом землю огортає.." ОСІНЬ.');
//   }

// } else {
//   alert('12. Швидко-швидко рік минає.Зима весну зустрічає.А весна шукає літо й осінь барвами зігріту.');
// }