"use strict";
// Завдання 2:

// — Напишіть функцію getSqrt(number), яка вираховує корінь квадратний. Для визначення кореня використовуйте Math.
// В залежності від того що передали в функцію має виводити наступні повідомлення:
// - Якщо передане число повертати - Квадратний корінь з стільки то дорівнює стільки то.
// - Якщо передали не число - Повинно бути числове значення.
// - Якщо число менше 0 - Введіть додатнє число.
// - Якщо в функцію нічого не передали - Будь ласка, введіть число!

let getSqrt = (number = prompt(" Введіть число ")) => {
	let result;
	if (number > 0) {
		result = Math.sqrt(number);
		alert(`Квадратний корінь з ${number} дорівнює ${result}`);
	} else if (number < 0) {
		result = alert("Введіть додатнє число");
	} else if (number != "" && number != null) {
		result = alert("Повинно бути числове значення.");
	} else {
		result = alert("Будь ласка, введіть число!");
	}
	return result;
};
getSqrt();
