"use strict";
// Завдання 1:

// — Пароль і 4 спроби. Завдання виконуємо через while або do while.

// 1. Запросити у користувача пароль!

// 2. Якщо пароль не вірний повідомити що залишилось 4 спроби!

// - якщо далі невірні паролі спроби зменшуються.

// - коли спроб вже нема вивести повідомлення: "Будь ласка спробуйте пізніше!".

// 3. Якщо користувач одразу чи після кількох спроб ввів вірний пароль, вивести повідомлення "Запрошуємо на сайт!".

// 4. Завдання реалізуємо без break і міток!

// let i = 4;
// let userInput = prompt("Введіть Ваш пароль");
// while (userInput.toLowerCase() != 'логос' && i != 0) {
//   alert(`Пароль не вірний, залишилось ${i} спроби.`);
//   i--;
//   userInput = prompt("Введіть Ваш пароль");

// } if (i==0 ) {
//      alert("Будь ласка спробуйте пізніше!");
// }
//   else if (i>=0) {
//      alert("Запрошуємо на сайт!");

// }

// task2.
// Створіть програму, яка обчислює факторіал натурального числа n, яке користувач введе з клавіатури.

// let n = +prompt('write count loop');
// let result = 1;
// let i = 1;
// while ( i <= n){
//   result *= i;
//   i++;
//   console.log(result);
// }

// Створіть програму, що виводить на екран всі чотиризначні числа послідовності 1000 1003 1006 1009 1012 1015 … 9999

let i = 1000;
while (i <= 9999) {
	document.write(`<h2>Loop ${i}</h2>`);
	i += 3;
}

// Створіть програму, що виводить на екран перші 55 елементів послідовності 1 3 5 7 9 11 13 15 17…

// let n = 1;
// let i = 1;
// while (i <= 55){
//   console.log(n);
//   ++i;
//   n += 2;
// }

// Створіть програму, що виводить на екран всі невід'ємні елементи послідовності 90 85 80 75 70 65 60…

// let i = 90;
// while (i >= 0){
//   console.log(i);
//   i -= 5;
// }

// Створіть програму, що виводить на екран перші 20 елементів послідовності 2 4 8 16 32 64 128…

// let n = 2;
// let i = 1;
// while (i <= 20) {
//   console.log(n);
//   i++;
//   n *= 2;
// }

// Виведіть на екран всі числа в послідовності 2a-1(крок зміни лічильника),
// де початкове значення a = 2 та які менше 10000.

// let a = 2;
// while ( a < 10000){
//   console.log(a);
//   a = a * 2 - 1;
// }

// Написати програму що обчислює піднесення до степеня.
//   В 1й промпт вводиться число, а в 2й промпт степінь.
//   Умови: Степінь може бути додатня, від'ємна або 0.

// let a = +prompt("Введіть число");
// let b = +prompt("Введіть степінь");
// let result = 1;
// let check = false;
// let i = 1;
// if (b < 0) {
// 	check = true;
// 	b = -b;
// }
// while (i <= b) {
// 	result *= a;
// 	i++;
// }
// if (check) {
// 	result = 1 / result;
// }
// console.log(result);
