'use strict';
// Завдання 2:

// — Написати розв’язок нижче описаного завдання за допомогою function expression:
// Створіть функцію, яка обраховує суму чисел геометричної прогресії, в якій першим числом є 1. Інформація про геометричну прогресію знаходиться тут:
// https://uk.wikipedia.org/wiki/Геометрична _прогресія
// http://ua.onlinemschool.com/math/formula/geometric_sequence/

// Функція приймає два аргументи: кількість чисел прогресії і її знаменник . Наприклад, в прогресії типу 1,2,4,8,16 кількість чисел - 5, а знаменник – 2 (тому що кожне наступне число прогресії домножується на 2). Результат, який має повернути функція для даної прогресії 31.
// Функцію потрібно написати двома способами:
// 1. З використанням циклу
// 2. З використанням формули знаходження суми геометричної прогресії:
// Sn=b1*(1-q^n)/(1-q),
// де b1 – перший елемент прогресії (в даному завданні це 1),
// q – знаменник,
// n – кількість елементів прогресії

// Приклад роботи:

// 1. f(5,2) – має повернути 1+2+4+8+16=31

// 2. f(4,3) – має повернути 1+3+9+27=40


//how_1

// let q; //знаменник
// let n;//кількість елементів прогресії
// const f = function (n, q) {
//   let b1 = 1;
//   let Sn = 1;
//   for (let i = 1; i < n; i++){
//     b1 *= q;
//     Sn += b1;
//   } return Sn;
// };
// console.log(f(5, 2));//31
// console.log(f(4, 3));//40
  
//or how_1

// let q; //знаменник
// let n;//кількість елементів прогресії
// const f =  (n, q) =>{
//   let b1 = 1;
//   let Sn = 1;
//   for (let i = 1; i < n; i++){
//     b1 *= q;
//     Sn += b1;
//   } return Sn;
// };
// console.log(f(5, 2));//31
// console.log(f(4, 3));//40


//how_2

// let q; //знаменник
// let n;//кількість елементів прогресії
// const f = function (n, q) {
//   let b1 = 1;
//   return (b1 * (1 - q ** n)) / (1 - q);
// };
// console.log(f(5, 2));//31
// console.log(f(4, 3));//40

//or how_2

let q; //знаменник
let n;//кількість елементів прогресії
let b1 = 1;
const f = (n, q) => q !=1 && q > 1 ? (b1 * (1 - q ** n)) / (1 - q) : b1 / (1 - q);

console.log(f(5, 2));//31
console.log(f(4, 3));//40